# 머신 러닝 워크 플로우 (Machine Learning Workflow)

# 수집 -> 점검 및 탐색 -> 전처리 및 정제 -> 모델링 및 훈련 -> 평가 -> 배포 

# 1. 수집(Acquisition)
# 머신 러닝을 하기 위해서는 기계에 학습시켜야 할 데이터가 필요합니다. 
# 자연어 처리의 경우, 자연어 데이터를 말뭉치 또는 코퍼스(corpus)라고 부르는데 코퍼스의 의미를 풀이하면,
# 조사나 연구 목적에 의해서 특정 도메인으로부터 수집된 텍스트 집합을 말합니다.

# 2. 점검 및 탐색(Inspection and exploration)
# 데이터의 구조, 노이즈 데이터, 머신 러닝 적용을 위해서 데이터를 어떻게 정제해야하는지 등을 파악

# 3.  전처리 및 정제(Preprocessing and Cleaning)
# 많은 단계를 포함하고 있는데, 가령 자연어 처리라면 토큰화, 정제, 정규화, 불용어 제거 등의 단계를 포함합니다.
#  빠르고 정확한 데이터 전처리를 하기 위해서는 사용하고 있는 툴에 대한 다양한 라이브러리에 대한 지식이 필요

# 4. 모델링 및 훈련(Modeling and Training)
# 적절한 머신 러닝 알고리즘을 선택하여 모델링이 끝났다면, 
# 전처리가 완료 된 데이터를 머신 러닝 알고리즘을 통해 기계에게 학습(training)

# 자연어 처리(natural language processing)란 이러한 자연어의 의미를 분석하여 컴퓨터가 처리할 수 있도록 하는 일