# 숫자 

# int(integer) : 정수 
# floay(floating point) : 부동 소수점(실수)
print(type(0))
print(type(0.0))

# 파이썬에서 지수 표현
print(0.52273e2)
print(0.52273e-2)

# 숫자 연산자 

# 사칙연산자 : + - * /
print("2 + 4 =", 2 + 4)
print("2 - 4 =", 2 + 4)
print("2 * 4 =", 2 + 4)
print("2 / 4 =", 2 + 4)

# 정수 나누기 연산자 : //
print("3 / 2 =", 3 / 2) # 결과 : 1.5
print("3 // 2 =", 3 // 2) # 결과 : 1 # //를 사용할 경우 소수점 이하는 버린다 

# 나머지 연산자 
print("5 % 2 =", 5 % 2) # 결과 : 1

# 제곱 연산자 : ** 
print("2 ** 1 =", 2 ** 1) # 결과 : 2
print("2 ** 2 =", 2 ** 2) # 결과 : 4
print("2 ** 3 =", 2 ** 3) # 결과 : 8
print("2 ** 4 =", 2 ** 4) # 결과 : 16

# 연산자의 우선순위 
# 숫자를 계산할때는 사칙연산의 우선순위 따라 결정
print(5 / 2 + 2 * 2) # 결과 : 6.5
print(4 / (2 + 2) * 2) # 결과 : 2

# tpyeError 예외 : 서로 다른 자료를 연산할 때 발생 
String = "안녕하세요"
number = 273
# String + number 




 